


#http://www.yes24.com/Product/goods/40936880

#1.?query가 없음. ajax(에이작스) 기술사용_ javascrpit
#2. 글 내용도 펼쳐보기 

' >> 샐레늄 이용' 

#개발자도구 - 네트워그 - type(xhr 형식)  : 에이작스 기술
# 에이작스 ~ 전체에서 필요한 부분만 읽어오기 
# 예. 장바구니 버튼을 누르면 장바구니 페이지로 넘어가는 것이 아니라 현재 페이지를 유지한 상태에서 상품만 담김.
# 에이작스 안쓰면 조금만 바꾸고 싶어도 웹페이지 전체를 다 바꿔야돼. 
# 웹 통신이 원래 그래 = 새로운 정보 : 새로운 웹 페이지 요청
# 데이터 전송량이 커진다. ... 모바일에서 이런다고?
# 에이작스!! _ 개발자 입장에서도 편함


#웹 2.0 을 나누는 기준. 페이스북 에이작스 없으면 ,,,


########      주목 [ 에이작스인지 판단 기준 ]     #########
#동적일 때
#개발자도구 - 네트워그 - type(xhr 형식)  : 에이작스 기술
#쿼리스트링이 없을 때 의심 

#!!링크 없는 콘텐츠 복사 - 페이지 소스보기 - 찾기 - 콘텐츠가 없다?  - 동적 컨텐츠
#    : 유저 화면에는 보이나(랜더링), 소스보기에서는 콘텐츠가 보이지 않음.
#          ~서버로 부터의 응답이 아니라 자바스크립트라는 프로그램에 의해 브라우저가 그것을 실행 의해서 출력된 것
#                  > 개발자도구 엘먼트는 현재페이지 출력 상태를 정적으로 표시하기 때문에 이것으로 판단하면 안된다.
#                       > 반드시 소스보기에서 확인해야 한다.



